11/data/attachments/f473deb12792b7e0.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_d68ab28d-3076-45c5-9efc-575aac863dcc</nif:username>
            <nif:friendToBeAdded>Edgar_than_Friend_59032_0</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>